In [134]:
import pandas as pd
import numpy as np

from get_db_url import get_db_url 
import env
host = env.host
username = env.username
password = env.password

In [2]:
url = get_db_url(username,host,password,"employees")

In [3]:
#Once you have successfully run a query:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [23]:
#Read the employees and titles tables into two separate DataFrames.
url = get_db_url(username,host,password,"employees")
sql = '''
SELECT
    *
FROM employees
LIMIT 100
'''
employees_df = pd.read_sql(sql, url)
sql2 = '''
SELECT
    *
FROM titles
LIMIT 100
'''
titles_df = pd.read_sql(sql2, url)

In [31]:
employees_df.dtypes
type(employees_df)
employees_df.describe()
employees_df

    emp_no  birth_date   first_name    last_name gender   hire_date
0    10001  1953-09-02       Georgi      Facello      M  1986-06-26
1    10002  1964-06-02      Bezalel       Simmel      F  1985-11-21
2    10003  1959-12-03        Parto      Bamford      M  1986-08-28
3    10004  1954-05-01    Chirstian      Koblick      M  1986-12-01
4    10005  1955-01-21      Kyoichi     Maliniak      M  1989-09-12
..     ...         ...          ...          ...    ...         ...
95   10096  1954-09-16       Jayson      Mandell      M  1990-01-14
96   10097  1952-02-27        Remzi  Waschkowski      M  1990-09-15
97   10098  1961-09-23  Sreekrishna    Servieres      F  1985-05-13
98   10099  1956-05-25       Valter      Sullins      F  1988-10-18
99   10100  1953-04-21     Hironobu    Haraldson      F  1987-09-21

[100 rows x 6 columns]

In [30]:
titles_df.dtypes ,type(titles_df)
titles_df

    emp_no               title   from_date     to_date
0    10001     Senior Engineer  1986-06-26  9999-01-01
1    10002               Staff  1996-08-03  9999-01-01
2    10003     Senior Engineer  1995-12-03  9999-01-01
3    10004            Engineer  1986-12-01  1995-12-01
4    10004     Senior Engineer  1995-12-01  9999-01-01
..     ...                 ...         ...         ...
95   10063     Senior Engineer  1989-04-08  9999-01-01
96   10064               Staff  1985-11-20  1992-03-02
97   10065            Engineer  1998-05-24  9999-01-01
98   10066  Assistant Engineer  1986-02-26  1992-02-26
99   10066            Engineer  1992-02-26  1998-02-25

[100 rows x 4 columns]

In [45]:
#How many unique titles are in the titles DataFrame?
len(titles_df.title.value_counts())

6

In [34]:
#What is the oldest date in the to_date column?
titles_df.to_date.min()

datetime.date(1987, 1, 27)

In [41]:
#What is the most recent date in the to_date column?
from datetime import date
today = date.today()
titles_df[titles_df.to_date < today].max()

emp_no                  10066
title        Technique Leader
from_date          2000-03-21
to_date            2002-07-15
dtype: object

In [47]:
users_df = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users_df

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [48]:

roles_df = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles_df

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [56]:
#What is the result of using a right join on the DataFrames?
pd.merge(users_df,roles_df,left_on="role_id",right_on="id",how="right")

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [57]:
#What is the result of using an outer join on the DataFrames?
pd.merge(users_df,roles_df,left_on="role_id",right_on="id",how="outer")

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [58]:
#What happens if you drop the foreign keys 
# from the DataFrames and try to merge them?
pd.merge(users_df,roles_df,how="outer")
#matches (id and name) and indexes

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
6   1      admin      NaN
7   2     author      NaN
8   3   reviewer      NaN
9   4  commenter      NaN

In [61]:
from pydataset import data
mpg_df = data("mpg")

#How many rows and columns are in the dataset?
mpg_df.shape

(234, 11)

In [ ]:
#Check out your column names and perform any cleanup you may want on them.
#looks good to me currently

In [63]:
#Display the summary statistics for the dataset.
mpg_df.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [67]:
#How many different manufacturers are there?
len(mpg_df.manufacturer.unique())

15

In [69]:
#How many different models are there?
len(mpg_df.model.unique())

38

In [70]:
#Create a column named mileage_difference like you did in the DataFrames 
# exercises; this column should contain the difference 
# between highway and city mileage for each car.
mpg_df["mileage_difference"] = mpg_df.hwy - mpg_df.cty

In [72]:
#Create a column named average_mileage like you did in the DataFrames 
# exercises; this is the mean of the city and highway mileage
mpg_df["average_mileage"] = ((mpg_df.hwy + mpg_df.cty)/2)
mpg_df

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [79]:
#Create a new column on the mpg dataset named is_automatic 
#that holds boolean values denoting whether the car has an 
#automatic transmission.
mpg_df["is_automatic"] = (mpg_df["trans"].str.count('auto') > 0)
mpg_df

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

In [86]:
#Using the mpg dataset, find out which which manufacturer 
# has the best miles per gallon on average?
mpg_df.groupby("manufacturer")["average_mileage"].mean().nlargest(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [87]:
#Do automatic or manual cars have better miles per gallon?
mpg_df.groupby("is_automatic")["average_mileage"].mean().nlargest(1)
#manual

is_automatic
False    22.227273
Name: average_mileage, dtype: float64

In [91]:
url2 = get_db_url(username,host,password,"chipotle")
sql = '''
SELECT
    *
FROM orders
LIMIT 10000
'''
chipotle_df = pd.read_sql(sql, url2)
chipotle_df

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [102]:
#What is the total price for each order?
chipotle_df["item_price_by_quantity"] = chipotle_df.quantity * (chipotle_df.item_price.str.strip("$").astype("float"))
chipotle_df.groupby("order_id")["item_price_by_quantity"].sum()

order_id
1       11.56
2       33.96
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price_by_quantity, Length: 1834, dtype: float64

In [105]:
#What are the most popular 3 items?
chipotle_df.groupby("item_name")["quantity"].sum().nlargest(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

In [107]:
#Which item has produced the most revenue?
chipotle_df.groupby("item_name")["item_price_by_quantity"].sum().nlargest(3)

item_name
Chicken Bowl       8044.63
Chicken Burrito    6387.06
Steak Burrito      4236.13
Name: item_price_by_quantity, dtype: float64

In [115]:
#Join the employees and titles DataFrames together
emp_titl_df = pd.merge(employees_df,titles_df,on="emp_no",how="inner")
emp_titl_df

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
5,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,Senior Staff,1996-09-12,9999-01-01
6,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,Staff,1989-09-12,1996-09-12
7,10006,1953-04-20,Anneke,Preusig,F,1989-06-02,Senior Engineer,1990-08-05,9999-01-01
8,10007,1957-05-23,Tzvetan,Zielinski,F,1989-02-10,Senior Staff,1996-02-11,9999-01-01
9,10007,1957-05-23,Tzvetan,Zielinski,F,1989-02-10,Staff,1989-02-10,1996-02-11
10,10008,1958-02-19,Saniya,Kalloufi,M,1994-09-15,Assistant Engineer,1998-03-11,2000-07-31
11,10009,1952-04-19,Sumant,Peac,F,1985-02-18,Assistant Engineer,1985-02-18,1990-02-18
12,10009,1952-04-19,Sumant,Peac,F,1985-02-18,Engineer,1990-02-18,1995-02-18
13,10009,1952-04-19,Sumant,Peac,F,1985-02-18,Senior Engineer,1995-02-18,9999-01-01
14,10010,1963-06-01,Duangkaew,Piveteau,F,1989-08-24,Engineer,1996-11-24,9999-01-01
15,10011,1953-11-07,Mary,Sluis,F,1990-01-22,Staff,1990-01-22,1996-11-09
16,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,Engineer,1992-12-18,2000-12-18
17,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,Senior Engineer,2000-12-18,9999-01-01
18,10013,1963-06-07,Eberhardt,Terkki,M,1985-10-20,Senior Staff,1985-10-20,9999-01-01
19,10014,1956-02-12,Berni,Genin,M,1987-03-11,Engineer,1993-12-29,9999-01-01
20,10015,1959-08-19,Guoxiang,Nooteboom,M,1987-07-02,Senior Staff,1992-09-19,1993-08-22
21,10016,1961-05-02,Kazuhito,Cappelletti,M,1995-01-27,Staff,1998-02-11,9999-01-01
22,10017,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,Senior Staff,2000-08-03,9999-01-01
23,10017,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,Staff,1993-08-03,2000-08-03
24,10018,1954-06-19,Kazuhide,Peha,F,1987-04-03,Engineer,1987-04-03,1995-04-03
25,10018,1954-06-19,Kazuhide,Peha,F,1987-04-03,Senior Engineer,1995-04-03,9999-01-01
26,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,Staff,1999-04-30,9999-01-01
27,10020,1952-12-24,Mayuko,Warwick,M,1991-01-26,Engineer,1997-12-30,9999-01-01
28,10021,1960-02-20,Ramzi,Erde,M,1988-02-10,Technique Leader,1988-02-10,2002-07-15
29,10022,1952-07-08,Shahaf,Famili,M,1995-08-22,Engineer,1999-09-03,9999-01-01
30,10023,1953-09-29,Bojan,Montemayor,F,1989-12-17,Engineer,1999-09-27,9999-01-01
31,10024,1958-09-05,Suzette,Pettey,F,1997-05-19,Assistant Engineer,1998-06-14,9999-01-01
32,10025,1958-10-31,Prasadram,Heyers,M,1987-08-17,Technique Leader,1987-08-17,1997-10-15
33,10026,1953-04-03,Yongqiao,Berztiss,M,1995-03-20,Engineer,1995-03-20,2001-03-19
34,10026,1953-04-03,Yongqiao,Berztiss,M,1995-03-20,Senior Engineer,2001-03-19,9999-01-01
35,10027,1962-07-10,Divier,Reistad,F,1989-07-07,Engineer,1995-04-02,2001-04-01
36,10027,1962-07-10,Divier,Reistad,F,1989-07-07,Senior Engineer,2001-04-01,9999-01-01
37,10028,1963-11-26,Domenick,Tempesti,M,1991-10-22,Engineer,1991-10-22,1998-04-06
38,10029,1956-12-13,Otmar,Herbst,M,1985-11-20,Engineer,1991-09-18,2000-09-17
39,10029,1956-12-13,Otmar,Herbst,M,1985-11-20,Senior Engineer,2000-09-17,9999-01-01
40,10030,1958-07-14,Elvis,Demeyer,M,1994-02-17,Engineer,1994-02-17,2001-02-17
41,10030,1958-07-14,Elvis,Demeyer,M,1994-02-17,Senior Engineer,2001-02-17,9999-01-01
42,10031,1959-01-27,Karsten,Joslin,M,1991-09-01,Engineer,1991-09-01,1998-09-01
43,10031,1959-01-27,Karsten,Joslin,M,1991-09-01,Senior Engineer,1998-09-01,9999-01-01
44,10032,1960-08-09,Jeong,Reistad,F,1990-06-20,Engineer,1990-06-20,1995-06-20
45,10032,1960-08-09,Jeong,Reistad,F,1990-06-20,Senior Engineer,1995-06-20,9999-01-01
46,10033,1956-11-14,Arif,Merlo,M,1987-03-18,Technique Leader,1987-03-18,1993-03-24
47,10034,1962-12-29,Bader,Swan,M,1988-09-21,Staff,1995-04-12,1999-10-31
48,10035,1953-02-08,Alain,Chappelet,M,1988-09-05,Engineer,1988-09-05,1996-09-05
49,10035,1953-02-08,Alain,Chappelet,M,1988-09-05,Senior Engineer,1996-09-05,9999-01-01
50,10036,1959-08-10,Adamantios,Portugali,M,1992-01-03,Senior Staff,1992-04-28,9999-01-01
51,10037,1963-07-22,Pradeep,Makrucki,M,1990-12-05,Engineer,1990-12-05,1995-12-05
52,10037,1963-07-22,Pradeep,Makrucki,M,1990-12-05,Senior Engineer,1995-12-05,9999-01-01
53,10038,1960-07-20,Huan,Lortz,M,1989-09-20,Senior Staff,1996-09-20,9999-01-01
54,10038,1960-07-20,Huan,Lortz,M,1989-09-20,Staff,1989-09-20,1996-09-20
55,10039,1959-10-01,Alejandro,Brender,M,1988-01-19,Senior Staff,1997-01-18,9999-01-01
56,10039,1959-10-01,Alejandro,Brender,M,1988-01-19,Staff,1988-01-19,1997-01-18
57,10040,1959-09-13,Weiyi,Meriste,F,1993-02-14,Engineer,1993-02-14,1999-02-14
58,10040,1959-09-13,Weiyi,Meriste,F,1993-02-14,Senior Engineer,1999-02-14,9999-01-01
59,10041,1959-08-27,Uri,Lenart,F,1989-11-12,Senior Staff,1998-11-12,9999-01-01
60,10041,1959-08-27,Uri,Lenart,F,1989-11-12,Staff,1989-11-12,1998-11-12
61,10042,1956-02-26,Magy,Stamatiou,F,1993-03-21,Senior Staff,2000-03-21,2000-08-10
62,10042,1956-02-26,Magy,Stamatiou,F,1993-03-21,Staff,1993-03-21,2000-03-21
63,10043,1960-09-19,Yishay,Tzvieli,M,1990-10-20,Engineer,1990-10-20,1997-10-20
64,10043,1960-09-19,Yishay,Tzvieli,M,1990-10-20,Senior Engineer,1997-10-20,9999-01-01
65,10044,1961-09-21,Mingsen,Casley,F,1994-05-21,Technique Leader,1994-05-21,9999-01-01
66,10045,1957-08-14,Moss,Shanbhogue,M,1989-09-02,Engineer,1996-11-16,9999-01-01
67,10046,1960-07-23,Lucien,Rosenbaum,M,1992-06-20,Senior Staff,2000-06-20,9999-01-01
68,10046,1960-07-23,Lucien,Rosenbaum,M,1992-06-20,Staff,1992-06-20,2000-06-20
69,10047,1952-06-29,Zvonko,Nyanchama,M,1989-03-31,Engineer,1989-03-31,1998-03-31
70,10047,1952-06-29,Zvonko,Nyanchama,M,1989-03-31,Senior Engineer,1998-03-31,9999-01-01
71,10048,1963-07-11,Florian,Syrotiuk,M,1985-02-24,Engineer,1985-02-24,1987-01-27
72,10049,1961-04-24,Basil,Tramer,F,1992-05-04,Senior Staff,2000-05-04,9999-01-01
73,10049,1961-04-24,Basil,Tramer,F,1992-05-04,Staff,1992-05-04,2000-05-04
74,10050,1958-05-21,Yinghua,Dredge,M,1990-12-25,Senior Staff,1999-12-25,9999-01-01
75,10050,1958-05-21,Yinghua,Dredge,M,1990-12-25,Staff,1990-12-25,1999-12-25
76,10051,1953-07-28,Hidefumi,Caine,M,1992-10-15,Engineer,1992-10-15,1998-10-15
77,10051,1953-07-28,Hidefumi,Caine,M,1992-10-15,Senior Engineer,1998-10-15,9999-01-01
78,10052,1961-02-26,Heping,Nitsch,M,1988-05-21,Senior Staff,2002-01-31,9999-01-01
79,10052,1961-02-26,Heping,Nitsch,M,1988-05-21,Staff,1997-01-31,2002-01-31
80,10053,1954-09-13,Sanjiv,Zschoche,F,1986-02-04,Senior Staff,1994-11-13,9999-01-01
81,10054,1957-04-04,Mayumi,Schueller,M,1995-03-13,Senior Staff,2000-07-28,9999-01-01
82,10054,1957-04-04,Mayumi,Schueller,M,1995-03-13,Staff,1995-07-29,2000-07-28
83,10055,1956-06-06,Georgy,Dredge,M,1992-04-27,Staff,1992-04-27,1995-07-22
84,10056,1961-09-01,Brendon,Bernini,F,1990-02-01,Engineer,1990-02-01,1999-02-01
85,10056,1961-09-01,Brendon,Bernini,F,1990-02-01,Senior Engineer,1999-02-01,9999-01-01
86,10057,1954-05-30,Ebbe,Callaway,F,1992-01-15,Engineer,1992-01-15,2000-01-15
87,10057,1954-05-30,Ebbe,Callaway,F,1992-01-15,Senior Engineer,2000-01-15,9999-01-01
88,10058,1954-10-01,Berhard,McFarlin,M,1987-04-13,Senior Staff,1988-04-25,9999-01-01
89,10059,1953-09-19,Alejandro,McAlpine,F,1991-06-26,Senior Staff,1991-06-26,9999-01-01
90,10060,1961-10-15,Breannda,Billingsley,M,1987-11-02,Senior Staff,1996-05-28,9999-01-01
91,10060,1961-10-15,Breannda,Billingsley,M,1987-11-02,Staff,1989-05-28,1996-05-28
92,10061,1962-10-19,Tse,Herber,M,1985-09-17,Senior Staff,1989-12-02,9999-01-01
93,10062,1961-11-02,Anoosh,Peyn,M,1991-08-30,Engineer,1991-08-30,1999-08-30
94,10062,1961-11-02,Anoosh,Peyn,M,1991-08-30,Senior Engineer,1999-08-30,9999-01-01
95,10063,1952-08-06,Gino,Leonhardt,F,1989-04-08,Senior Engineer,1989-04-08,9999-01-01
96,10064,1959-04-07,Udi,Jansch,M,1985-11-20,Staff,1985-11-20,1992-03-02
97,10065,1963-04-14,Satosi,Awdeh,M,1988-05-18,Engineer,1998-05-24,9999-01-01
98,10066,1952-11-13,Kwee,Schusler,M,1986-02-26,Assistant Engineer,1986-02-26,1992-02-26
99,10066,1952-11-13,Kwee,Schusler,M,1986-02-26,Engineer,1992-02-26,1998-02-25

In [122]:
#For each title, find the hire date of the employee that 
# was hired most recently with that title.
emp_titl_df.groupby("title")["from_date"].max()

title
Assistant Engineer    1998-06-14
Engineer              1999-09-27
Senior Engineer       2001-04-01
Senior Staff          2002-01-31
Staff                 1999-04-30
Technique Leader      1994-05-21
Name: from_date, dtype: object

In [130]:
url3 = get_db_url(username,host,password,"employees")
sql = '''
SELECT
    *
FROM departments
LIMIT 10000
'''
department_df = pd.read_sql(sql, url3)
department_df.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

In [127]:
url4 = get_db_url(username,host,password,"employees")
sql = '''
SELECT
    *
FROM dept_emp
LIMIT 10000
'''
dept_emp_df = pd.read_sql(sql, url4)
dept_emp_df.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [128]:
#Write the code necessary to create a cross tabulation of the 
# number of titles by department. 
# (Hint: this will involve a combination of SQL code to 
# pull the necessary data and python/pandas code to 
# perform the manipulations.)
emp_title_deptno_df = pd.merge(emp_titl_df,dept_emp_df,on="emp_no",how="inner")
emp_title_deptno_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date_x,to_date_x,dept_no,from_date_y,to_date_y
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01,d005,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01,d007,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01,d004,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01,d004,1986-12-01,9999-01-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01,d004,1986-12-01,9999-01-01

In [129]:
all_info_employees_df = pd.merge(emp_title_deptno_df,department_df,on="dept_no",how="inner")
all_info_employees_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date_x,to_date_x,dept_no,from_date_y,to_date_y,dept_name
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01,d005,1986-06-26,9999-01-01,Development
1,10006,1953-04-20,Anneke,Preusig,F,1989-06-02,Senior Engineer,1990-08-05,9999-01-01,d005,1990-08-05,9999-01-01,Development
2,10008,1958-02-19,Saniya,Kalloufi,M,1994-09-15,Assistant Engineer,1998-03-11,2000-07-31,d005,1998-03-11,2000-07-31,Development
3,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,Engineer,1992-12-18,2000-12-18,d005,1992-12-18,9999-01-01,Development
4,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,Senior Engineer,2000-12-18,9999-01-01,d005,1992-12-18,9999-01-01,Development

In [132]:
pd.crosstab(all_info_employees_df.title,all_info_employees_df.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,0,2,0,0,0,1,1,0,0
Engineer,0,17,0,0,0,12,3,1,0
Senior Engineer,0,12,0,0,0,11,2,1,0
Senior Staff,3,0,3,5,2,0,0,4,5
Staff,4,0,2,3,2,0,0,5,6
Technique Leader,0,2,0,0,0,1,1,0,0